app/Controllers/Beranda.php

SELECT *
FROM `topik`
---
    public function index()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('topik');
        $query   = $builder->get()->getResult();