app/Controllers/Homesiswa.php

    public function index()
    {
        $currentPage = 'Dashboard';
        $data['current_page'] = $currentPage;

        if (session()->get("logged_siswa")) {
            // Query untuk mendapatkan topik dan jumlah subtopik
            $db      = \Config\Database::connect();
            $builder = $db->table('topik');
            $builder->select('topik.*, COUNT(subtopik.idsubtopik) as jumlah_subtopik');
            $builder->join('subtopik', 'subtopik.idtopik = topik.idtopik', 'left');
            $builder->groupBy('topik.idtopik');
            $query = $builder->get();
            $data['topik'] = $query->getResult();

            // Query untuk mendapatkan subtopik berdasarkan idtopik
            $subtopikBuilder = $db->table('subtopik');
            $subtopikQuery = $subtopikBuilder->get();
---
SELECT `topik`.*, COUNT(subtopik.idsubtopik) as jumlah_subtopik
FROM `topik`
LEFT JOIN `subtopik` ON `subtopik`.`idtopik` = `topik`.`idtopik`
GROUP BY `topik`.`idtopik`
SELECT *
FROM `subtopik`